Revit 2027 API
GeomCombinationSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual GeomCombinationSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As GeomCombinationSetIterator
public:
virtual GeomCombinationSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> GeomCombinationSetIterator
override ForwardIterator : unit -> GeomCombinationSetIterator
Return Value
GeomCombinationSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
GeomCombinationSet Class
Autodesk.Revit.DB Namespace